Continued plan output from previous comment.
<details><summary>Show Output</summary>

```diff
_bytes                   = [
          - {
              - value             = 178176
              - value_in_ia       = 0
              - value_in_standard = 178176
            },
        ] -> null
      - tags                            = {} -> null
      - tags_all                        = {
          - "DeployedBy" = "Terraform"
        } -> null
      - throughput_mode                 = "bursting" -> null
        # (3 unchanged attributes hidden)

      - protection {
          - replication_overwrite = "ENABLED" -> null
        }
    }

  # aws_efs_mount_target.efs_mount will be destroyed
  # (because aws_efs_mount_target.efs_mount is not in configuration)
- resource "aws_efs_mount_target" "efs_mount" {
      - availability_zone_id   = "use2-az2" -> null
      - availability_zone_name = "us-east-2b" -> null
      - dns_name               = "fs-0aff801cffc9657e7.efs.us-east-2.amazonaws.com" -> null
      - file_system_arn        = "arn:aws:elasticfilesystem:us-east-2:481665084477:file-system/fs-0aff801cffc9657e7" -> null
      - file_system_id         = "fs-0aff801cffc9657e7" -> null
      - id                     = "fsmt-0a14544f358887bdb" -> null
      - ip_address             = "10.0.1.221" -> null
      - mount_target_dns_name  = "us-east-2b.fs-0aff801cffc9657e7.efs.us-east-2.amazonaws.com" -> null
      - network_interface_id   = "eni-0949d5edfd92639d3" -> null
      - owner_id               = "481665084477" -> null
      - security_groups        = [
          - "sg-0352113cf7b778773",
        ] -> null
      - subnet_id              = "subnet-04e8b4750edd74d6c" -> null
    }

  # aws_eip.nat_eip will be destroyed
  # (because aws_eip.nat_eip is not in configuration)
- resource "aws_eip" "nat_eip" {
      - allocation_id            = "eipalloc-034b2d3256256046b" -> null
      - arn                      = "arn:aws:ec2:us-east-2:481665084477:elastic-ip/eipalloc-034b2d3256256046b" -> null
      - association_id           = "eipassoc-0ffdee231620e52ee" -> null
      - domain                   = "vpc" -> null
      - id                       = "eipalloc-034b2d3256256046b" -> null
      - network_border_group     = "us-east-2" -> null
      - network_interface        = "eni-071e967423b242547" -> null
      - private_dns              = "ip-10-0-0-7.us-east-2.compute.internal" -> null
      - private_ip               = "10.0.0.7" -> null
      - public_dns               = "ec2-3-147-172-222.us-east-2.compute.amazonaws.com" -> null
      - public_ip                = "3.147.172.222" -> null
      - public_ipv4_pool         = "amazon" -> null
      - tags                     = {} -> null
      - tags_all                 = {
          - "DeployedBy" = "Terraform"
        } -> null
      - vpc                      = true -> null
        # (5 unchanged attributes hidden)
    }

  # aws_iam_policy.eventbridge_policy must be replaced
-/+ resource "aws_iam_policy" "eventbridge_policy" {
      ~ arn              = "arn:aws:iam::481665084477:policy/eventbridge_step_functions_policy" -> (known after apply)
      ~ attachment_count = 1 -> (known after apply)
      ~ id               = "arn:aws:iam::481665084477:policy/eventbridge_step_functions_policy" -> (known after apply)
      ~ name             = "eventbridge_step_functions_policy" -> "animeutopia_eventbridge_step_functions_policy" # forces replacement
      + name_prefix      = (known after apply)
      ~ policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "states:StartExecution"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:states:us-east-2:481665084477:stateMachine:anime_workflow"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      ~ policy_id        = "ANPAXAJLZ5Q662BIOMWA3" -> (known after apply)
      - tags             = {} -> null
      ~ tags_all         = {
          + "Environment" = "prod"
          + "Project"     = "project"
            # (1 unchanged element hidden)
        }
        # (2 unchanged attributes hidden)
    }

  # aws_iam_policy.s3_full_policy must be replaced
-/+ resource "aws_iam_policy" "s3_full_policy" {
      ~ arn              = "arn:aws:iam::481665084477:policy/anime_s3_full_policy" -> (known after apply)
      ~ attachment_count = 1 -> (known after apply)
      ~ id               = "arn:aws:iam::481665084477:policy/anime_s3_full_policy" -> (known after apply)
      ~ name             = "anime_s3_full_policy" -> "animeutopia_s3_full_policy" # forces replacement
      + name_prefix      = (known after apply)
      ~ policy_id        = "ANPAXAJLZ5Q65QX2IGX3M" -> (known after apply)
      - tags             = {} -> null
      ~ tags_all         = {
          + "Environment" = "prod"
          + "Project"     = "project"
            # (1 unchanged element hidden)
        }
        # (3 unchanged attributes hidden)
    }

  # aws_iam_role.crossaccount_s3_read_role will be created
+ resource "aws_iam_role" "crossaccount_s3_read_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::825765422855:root"
                        }
                      + Sid       = "AllowSharedServicesAssumeRole"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "CrossAccountS3ReadRole"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "project"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role.eventbridge_role must be replaced
-/+ resource "aws_iam_role" "eventbridge_role" {
      ~ arn                   = "arn:aws:iam::481665084477:role/eventbridge_step_functions_role" -> (known after apply)
      ~ create_date           = "2025-03-11T15:17:30Z" -> (known after apply)
      ~ id                    = "eventbridge_step_functions_role" -> (known after apply)
      ~ managed_policy_arns   = [
          - "arn:aws:iam::481665084477:policy/eventbridge_step_functions_policy",
        ] -> (known after apply)
      ~ name                  = "eventbridge_step_functions_role" -> "animeutopia_eventbridge_step_functions_role" # forces replacement
      + name_prefix           = (known after apply)
      - tags                  = {} -> null
      ~ tags_all              = {
          + "Environment" = "prod"
          + "Project"     = "project"
            # (1 unchanged element hidden)
        }
      ~ unique_id             = "AROAXAJLZ5Q6Q4DG5EIW4" -> (known after apply)
        # (6 unchanged attributes hidden)

      ~ inline_policy (known after apply)
    }

  # aws_iam_role.lambda_role must be replaced
-/+ resource "aws_iam_role" "lambda_role" {
      ~ arn                   = "arn:aws:iam::481665084477:role/anime_lambda_role" -> (known after apply)
      ~ create_date           = "2025-03-11T15:17:30Z" -> (known after apply)
      ~ id                    = "anime_lambda_role" -> (known after apply)
      ~ managed_policy_arns   = [
          - "arn:aws:iam::481665084477:policy/anime_s3_full_policy",
          - "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole",
          - "arn:aws:iam::aws:policy/service-role/AWSLambdaVPCAccessExecutionRole",
        ] -> (known after apply)
      ~ name                  = "anime_lambda_role" -> "animeutopia_lambda_role" # forces replacement
      + name_prefix           = (known after apply)
      - tags                  = {} -> null
      ~ tags_all              = {
          + "Environment" = "prod"
          + "Project"     = "project"
            # (1 unchanged element hidden)
        }
      ~ unique_id             = "AROAXAJLZ5Q67XS7VQ3PE" -> (known after apply)
        # (6 unchanged attributes hidden)

      ~ inline_policy (known after apply)
    }

  # aws_iam_role.step_functions_role must be replaced
-/+ resource "aws_iam_role" "step_functions_role" {
      ~ arn                   = "arn:aws:iam::481665084477:role/anime_step_functions_role" -> (known after apply)
      ~ create_date           = "2025-03-11T15:17:30Z" -> (known after apply)
      ~ id                    = "anime_step_functions_role" -> (known after apply)
      ~ managed_policy_arns   = [] -> (known after apply)
      ~ name                  = "anime_step_functions_role" -> "animeutopia_step_functions_role" # forces replacement
      + name_prefix           = (known after apply)
      - tags                  = {} -> null
      ~ tags_all              = {
          + "Environment" = "prod"
          + "Project"     = "project"
            # (1 unchanged element hidden)
        }
      ~ unique_id             = "AROAXAJLZ5Q6YCDU47T5V" -> (known after apply)
        # (6 unchanged attributes hidden)

      ~ inline_policy (known after apply)
      - inline_policy {
          - name   = "anime_step_functions_policy" -> null
          - policy = jsonencode(
                {
                  - Statement = [
                      - {
                          - Action   = [
                              - "lambda:InvokeFunction",
                            ]
                          - Effect   = "Allow"
                          - Resource = [
                              - "arn:aws:lambda:us-east-2:481665084477:function:fetch_rss",
                              - "arn:aws:lambda:us-east-2:481665084477:function:process_content",
                              - "arn:aws:lambda:us-east-2:481665084477:function:store_data",
                              - "arn:aws:lambda:us-east-2:481665084477:function:render_video",
                              - "arn:aws:lambda:us-east-2:481665084477:function:notify_post",
                            ]
                        },
                    ]
                  - Version   = "2012-10-17"
                }
            ) -> null
        }
    }

  # aws_iam_role_policy.crossaccount_s3_read_policy will be created
+ resource "aws_iam_role_policy" "crossaccount_s3_read_policy" {
      + id          = (known after apply)
      + name        = "WrestleUtopiaReadLogo"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "s3:*"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:s3:::prod-animeutopia-artifacts-bucket/*"
                      + Sid      = "AllowGetLogo"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

  # aws_iam_role_policy.lambda_sqs_send_message will be created
+ resource "aws_iam_role_policy" "lambda_sqs_send_message" {
      + id          = (known after apply)
      + name        = "animeutopia_lambda_sqs_send_message"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = (known after apply)
    }

  # aws_iam_role_policy.step_functions_policy must be replaced
-/+ resource "aws_iam_role_policy" "step_functions_policy" {
      ~ id          = "anime_step_functions_role:anime_step_functions_policy" -> (known after apply)
      ~ name        = "anime_step_functions_policy" -> "animeutopia_step_functions_policy" # forces replacement
      + name_prefix = (known after apply)
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "lambda:InvokeFunction",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:lambda:us-east-2:481665084477:function:fetch_rss",
                          - "arn:aws:lambda:us-east-2:481665084477:function:process_content",
                          - "arn:aws:lambda:us-east-2:481665084477:function:store_data",
                          - "arn:aws:lambda:us-east-2:481665084477:function:render_video",
                          - "arn:aws:lambda:us-east-2:481665084477:function:notify_post",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      ~ role        = "anime_step_functions_role" -> (known after apply) # forces replacement
    }

  # aws_iam_role_policy.step_functions_xray will be created
+ resource "aws_iam_role_policy" "step_functions_xray" {
      + id          = (known after apply)
      + name        = "step-functions-xray-policy"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "xray:PutTraceSegments",
                          + "xray:PutTelemetryRecords",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "AllowXRayWrites"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

  # aws_iam_role_policy_attachment.attach_eventbridge_policy must be replaced
-/+ resource "aws_iam_role_policy_attachment" "attach_eventbridge_policy" {
      ~ id         = "eventbridge_step_functions_role-20250311185321456100000001" -> (known after apply)
      ~ policy_arn = "arn:aws:iam::481665084477:policy/eventbridge_step_functions_policy" -> (known after apply) # forces replacement
      ~ role       = "eventbridge_step_functions_role" -> "animeutopia_eventbridge_step_functions_role" # forces replacement
    }

  # aws_iam_role_policy_attachment.attach_s3_full_policy will be destroyed
  # (because aws_iam_role_policy_attachment.attach_s3_full_policy is not in configuration)
- resource "aws_iam_role_policy_attachment" "attach_s3_full_policy" {
      - id         = "anime_lambda_role-20250311151731257600000001" -> null
      - policy_arn = "arn:aws:iam::481665084477:policy/anime_s3_full_policy" -> null
      - role       = "anime_lambda_role" -> null
    }

  # aws_iam_role_policy_attachment.lambda_basic_execution must be replaced
-/+ resource "aws_iam_role_policy_attachment" "lambda_basic_execution" {
      ~ id         = "anime_lambda_role-20250311151731272200000002" -> (known after apply)
      ~ role       = "anime_lambda_role" -> "animeutopia_lambda_role" # forces replacement
        # (1 unchanged attribute hidden)
    }

  # aws_iam_role_policy_attachment.lambda_insights_policy will be created
+ resource "aws_iam_role_policy_attachment" "lambda_insights_policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/CloudWatchLambdaInsightsExecutionRolePolicy"
      + role       = "animeutopia_lambda_role"
    }

  # aws_iam_role_policy_attachment.lambda_s3_full_access will be created
+ resource "aws_iam_role_policy_attachment" "lambda_s3_full_access" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "animeutopia_lambda_role"
    }

  # aws_iam_role_policy_attachment.lambda_sqs_send_message will be created
+ resource "aws_iam_role_policy_attachment" "lambda_sqs_send_message" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaSQSQueueExecutionRole"
      + role       = "animeutopia_lambda_role"
    }

  # aws_iam_role_policy_attachment.lambda_vpc_access will be destroyed
  # (because aws_iam_role_policy_attachment.lambda_vpc_access is not in configuration)
- resource "aws_iam_role_policy_attachment" "lambda_vpc_access" {
      - id         = "anime_lambda_role-20250315230135653000000001" -> null
      - policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaVPCAccessExecutionRole" -> null
      - role       = "anime_lambda_role" -> null
    }

  # aws_iam_role_policy_attachment.lambda_xray_write_access will be created
+ resource "aws_iam_role_policy_attachment" "lambda_xray_write_access" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AWSXRayDaemonWriteAccess"
      + role       = "animeutopia_lambda_role"
    }

  # aws_internet_gateway.example_igw will be destroyed
  # (because aws_internet_gateway.example_igw is not in configuration)
- resource "aws_internet_gateway" "example_igw" {
      - arn      = "arn:aws:ec2:us-east-2:481665084477:internet-gateway/igw-0ed132994ed923492" -> null
      - id       = "igw-0ed132994ed923492" -> null
      - owner_id = "481665084477" -> null
      - tags     = {
          - "Name" = "example-igw"
        } -> null
      - tags_all = {
          - "DeployedBy" = "Terraform"
          - "Name"       = "example-igw"
        } -> null
      - vpc_id   = "vpc-032fa89d4525841f0" -> null
    }

  # aws_lambda_function.check_duplicate will be created
+ resource "aws_lambda_function" "check_duplicate" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + filename                       = "./artifacts/scripts/check_duplicate/check_duplicate.zip"
      + function_name                  = "check_duplicate"
      + handler                        = "lambda_function.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = [
          + "arn:aws:lambda:us-east-2:580247275435:layer:LambdaInsightsExtension:14",
        ]
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.9"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = "5RDm7ZPiHkvVOwrSMVzPg5Qm1+3o0ljlpM7C9gaEBgc="
      + source_code_size               = (known after apply)
      + tags_all                       = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "project"
        }
      + timeout                        = 5
      + version                        = (known after apply)

      + dead_letter_config {
          + target_arn = (known after apply)
        }

      + environment {
          + variables = {
              + "IDEMPOTENCY_BUCKET" = "prod-animeutopia-media-bucket"
            }
        }

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config {
          + mode = "Active"
        }
    }

  # aws_lambda_function.fetch_data will be created
+ resource "aws_lambda_function" "fetch_data" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + filename                       = "./artifacts/scripts/fetch_data/fetch_data.zip"
      + function_name                  = "fetch_data"
      + handler                        = "lambda_function.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = [
          + "arn:aws:lambda:us-east-2:580247275435:layer:LambdaInsightsExtension:14",
          + "arn:aws:lambda:us-east-2:825765422855:layer:Python_FeedParser:1",
        ]
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.9"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = "hP2dINEdJqZTa0jTMLeccMkJ6NKvP6bANgU7BjYJvT0="
      + source_code_size               = (known after apply)
      + tags_all                       = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "project"
        }
      + timeout                        = 5
      + version                        = (known after apply)

      + dead_letter_config {
          + target_arn = (known after apply)
        }

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config {
          + mode = "Active"
        }
    }

  # aws_lambda_function.fetch_rss will be destroyed
  # (because aws_lambda_function.fetch_rss is not in configuration)
- resource "aws_lambda_function" "fetch_rss" {
      - architectures                  = [
          - "x86_64",
        ] -> null
      - arn                            = "arn:aws:lambda:us-east-2:481665084477:function:fetch_rss" -> null
      - code_sha256                    = "xTAS3Ntxo89+oBY6o1wDCgU43Jy3ZsG7frf/Ks1ITkc=" -> null
      - filename                       = "./artifacts/scripts/fetch_rss/fetch_rss.zip" -> null
      - function_name                  = "fetch_rss" -> null
      - handler                        = "lambda_function.lambda_handler" -> null
      - id                             = "fetch_rss" -> null
      - invoke_arn                     = "arn:aws:apigateway:us-east-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-2:481665084477:function:fetch_rss/invocations" -> null
      - last_modified                  = "2025-03-11T19:03:37.000+0000" -> null
      - layers                         = [] -> null
      - memory_size                    = 128 -> null
      - package_type                   = "Zip" -> null
      - publish                        = false -> null
      - qualified_arn                  = "arn:aws:lambda:us-east-2:481665084477:function:fetch_rss:$LATEST" -> null
      - qualified_invoke_arn           = "arn:aws:apigateway:us-east-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-2:481665084477:function:fetch_rss:$LATEST/invocations" -> null
      - reserved_concurrent_executions = -1 -> null
      - role                           = "arn:aws:iam::481665084477:role/anime_lambda_role" -> null
      - runtime                        = "python3.9" -> null
      - skip_destroy                   = false -> null
      - source_code_hash               = "xTAS3Ntxo89+oBY6o1wDCgU43Jy3ZsG7frf/Ks1ITkc=" -> null
      - source_code_size               = 205209 -> null
      - tags                           = {} -> null
      - tags_all                       = {
          - "DeployedBy" = "Terraform"
        } -> null
      - timeout                        = 10 -> null
      - version                        = "$LATEST" -> null
        # (6 unchanged attributes hidden)

      - ephemeral_storage {
          - size = 512 -> null
        }

      - logging_config {
          - log_format            = "Text" -> null
          - log_group             = "/aws/lambda/fetch_rss" -> null
            # (2 unchanged attributes hidden)
        }

      - tracing_config {
          - mode = "PassThrough" -> null
        }
    }

  # aws_lambda_function.notify_post will be updated in-place
~ resource "aws_lambda_function" "notify_post" {
        id                             = "notify_post"
      ~ last_modified                  = "2025-03-15T23:34:30.000+0000" -> (known after apply)
      ~ layers                         = [
          + "arn:aws:lambda:us-east-2:825765422855:layer:Python_Requests:1",
          + "arn:aws:lambda:us-east-2:580247275435:layer:LambdaInsightsExtension:14",
        ]
      ~ role                           = "arn:aws:iam::481665084477:role/anime_lambda_role" -> (known after apply)
      ~ source_code_hash               = "QDd1yqsLGZLaWlY2CCBjF1APH11LyE1nj6QSUDH/R5s=" -> "nfttRDJQYCGYEFGikSe2r8MqtItSbtRoYHszMMMy+to="
        tags                           = {}
      ~ tags_all                       = {
          + "Environment" = "prod"
          + "Project"     = "project"
            # (1 unchanged element hidden)
        }
      ~ timeout                        = 10 -> 5
        # (23 unchanged attributes hidden)

      + dead_letter_config {
          + target_arn = (known after apply)
        }

      ~ tracing_config {
          ~ mode = "PassThrough" -> "Active"
        }

        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.process_content will be destroyed
  # (because aws_lambda_function.process_content is not in configuration)
- resource "aws_lambda_function" "process_content" {
      - architectures                  = [
          - "x86_64",
        ] -> null
      - arn                            = "arn:aws:lambda:us-east-2:481665084477:function:process_content" -> null
      - code_sha256                    = "EDbNPzIJ16erKsF0z27ZoCRM2OF7JLsOVX3UM8n5OF8=" -> null
      - filename                       = "./artifacts/scripts/process_content/process_content.zip" -> null
      - function_name                  = "process_content" -> null
      - handler                        = "lambda_function.lambda_handler" -> null
      - id                             = "process_content" -> null
      - invoke_arn                     = "arn:aws:apigateway:us-east-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-2:481665084477:function:process_content/invocations" -> null
      - last_modified                  = "2025-03-16T16:50:28.000+0000" -> null
      - layers                         = [
          - "arn:aws:lambda:us-east-2:481665084477:layer:imagick-layer:1",
        ] -> null
      - memory_size                    = 128 -> null
      - package_type                   = "Zip" -> null
      - publish                        = false -> null
      - qualified_arn                  = "arn:aws:lambda:us-east-2:481665084477:function:process_content:$LATEST" -> null
      - qualified_invoke_arn           = "arn:aws:apigateway:us-east-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-2:481665084477:function:process_content:$LATEST/invocations" -> null
      - reserved_concurrent_executions = -1 -> null
      - role                           = "arn:aws:iam::481665084477:role/anime_lambda_role" -> null
      - runtime                        = "python3.9" -> null
      - skip_destroy                   = false -> null
      - source_code_hash               = "EDbNPzIJ16erKsF0z27ZoCRM2OF7JLsOVX3UM8n5OF8=" -> null
      - source_code_size               = 2938677 -> null
      - tags                           = {} -> null
      - tags_all                       = {
          - "DeployedBy" = "Terraform"
        } -> null
      - timeout                        = 15 -> null
      - version                        = "$LATEST" -> null
        # (6 unchanged attributes hidden)

      - environment {
          - variables = {
              - "IMAGE_MAGICK_EXE" = "/bin/magick"
            } -> null
        }

      - ephemeral_storage {
          - size = 512 -> null
        }

      - logging_config {
          - log_format            = "Text" -> null
          - log_group             = "/aws/lambda/process_content" -> null
            # (2 unchanged attributes hidden)
        }

      - tracing_config {
          - mode = "PassThrough" -> null
        }

      - vpc_config {
          - ipv6_allowed_for_dual_stack = false -> null
          - security_group_ids          = [
              - "sg-003032d1214f56b1d",
            ] -> null
          - subnet_ids                  = [
              - "subnet-04e8b4750edd74d6c",
            ] -> null
          - vpc_id                      = "vpc-032fa89d4525841f0" -> null
        }
    }

  # aws_lambda_function.render_video will be destroyed
  # (because aws_lambda_function.render_video is not in configuration)
- resource "aws_lambda_function" "render_video" {
      - architectures                  = [
          - "x86_64",
        ] -> null
      - arn                            = "arn:aws:lambda:us-east-2:481665084477:function:render_video" -> null
      - code_sha256                    = "52931861e7b2483cdf57967d3e5b42ebe111c3e31e04492db00809c75b4da3d9" -> null
      - function_name                  = "render_video" -> null
      - id                             = "render_video" -> null
      - image_uri                      = "481665084477.dkr.ecr.us-east-2.amazonaws.com/render_video_repository@sha256:52931861e7b2483cdf57967d3e5b42ebe111c3e31e04492db00809c75b4da3d9" -> null
      - invoke_arn                     = "arn:aws:apigateway:us-east-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-2:481665084477:function:render_video/invocations" -> null
      - last_modified                  = "2025-03-16T16:50:28.000+0000" -> null
      - layers                         = [] -> null
      - memory_size                    = 3008 -> null
      - package_type                   = "Image" -> null
      - publish                        = false -> null
      - qualified_arn                  = "arn:aws:lambda:us-east-2:481665084477:function:render_video:$LATEST" -> null
      - qualified_invoke_arn           = "arn:aws:apigateway:us-east-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-2:481665084477:function:render_video:$LATEST/invocations" -> null
      - reserved_concurrent_executions = -1 -> null
      - role                           = "arn:aws:iam::481665084477:role/anime_lambda_role" -> null
      - skip_destroy                   = false -> null
      - source_code_size               = 0 -> null
      - tags                           = {} -> null
      - tags_all                       = {
          - "DeployedBy" = "Terraform"
        } -> null
      - timeout                        = 300 -> null
      - version                        = "$LATEST" -> null
        # (8 unchanged attributes hidden)

      - environment {
          - variables = {
              - "FFMPEG_PATH"   = "/opt/bin/ffmpeg"
              - "TARGET_BUCKET" = "prod-animeutopia-media-bucket"
            } -> null
        }

      - ephemeral_storage {
          - size = 512 -> null
        }

      - file_system_config {
          - arn              = "arn:aws:elasticfilesystem:us-east-2:481665084477:access-point/fsap-0191ef7595cace3d5" -> null
          - local_mount_path = "/mnt/efs" -> null
        }

      - logging_config {
          - log_format            = "Text" -> null
          - log_group             = "/aws/lambda/render_video" -> null
            # (2 unchanged attributes hidden)
        }

      - tracing_config {
          - mode = "PassThrough" -> null
        }

      - vpc_config {
          - ipv6_allowed_for_dual_stack = false -> null
          - security_group_ids          = [
              - "sg-003032d1214f56b1d",
            ] -> null
          - subnet_ids                  = [
              - "subnet-04e8b4750edd74d6c",
            ] -> null
          - vpc_id                      = "vpc-032fa89d4525841f0" -> null
        }
    }

  # aws_lambda_function.sns_to_teams will be created
+ resource "aws_lambda_function" "sns_to_teams" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + filename                       = "./artifacts/scripts/sns_to_teams/sns_to_teams.zip"
      + function_name                  = "sns_to_teams"
      + handler                        = "lambda_function.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.9"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = "oDE43acE3cTYKZykhbf18oWRZO9wosHvrgR7dbC24zs="
      + source_code_size               = (known after apply)
      + tags_all                       = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "project"
        }
      + timeout                        = 5
      + version                        = (known after apply)

      + dead_letter_config {
          + target_arn = (known after apply)
        }

      + environment {
          + variables = {
              + "TEAMS_WEBHOOK_URL" = "https://feedutopia.webhook.office.com/webhookb2/15bab4d6-66e1-4121-8e53-f72e565043db@c76f234b-5cdf-49b5-b968-9d0517a5c694/IncomingWebhook/74d88730408141d995e6d3332f350d9c/2742a55c-9d93-47f0-aed1-1965283926c0/V2HdJ-E9GgUG_Vndpd0UX6B240fszGkuj9F-du8xCTvvA1"
            }
        }

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config {
          + mode = "Active"
        }
    }

  # aws_lambda_function.store_data will be destroyed
  # (because aws_lambda_function.store_data is not in configuration)
- resource "aws_lambda_function" "store_data" {
      - architectures                  = [
          - "x86_64",
        ] -> null
      - arn                            = "arn:aws:lambda:us-east-2:481665084477:function:store_data" -> null
      - code_sha256                    = "xbFSeoIoi8FEdK9TKvtCnYv8tSTzQh3azQ0/0Y+gcH4=" -> null
      - filename                       = "./artifacts/scripts/store_data/store_data.zip" -> null
      - function_name                  = "store_data" -> null
      - handler                        = "lambda_function.lambda_handler" -> null
      - id                             = "store_data" -> null
      - invoke_arn                     = "arn:aws:apigateway:us-east-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-2:481665084477:function:store_data/invocations" -> null
      - last_modified                  = "2025-03-11T19:03:37.000+0000" -> null
      - layers                         = [] -> null
      - memory_size                    = 128 -> null
      - package_type                   = "Zip" -> null
      - publish                        = false -> null
      - qualified_arn                  = "arn:aws:lambda:us-east-2:481665084477:function:store_data:$LATEST" -> null
      - qualified_invoke_arn           = "arn:aws:apigateway:us-east-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-2:481665084477:function:store_data:$LATEST/invocations" -> null
      - reserved_concurrent_executions = -1 -> null
      - role                           = "arn:aws:iam::481665084477:role/anime_lambda_role" -> null
      - runtime                        = "python3.9" -> null
      - skip_destroy                   = false -> null
      - source_code_hash               = "xbFSeoIoi8FEdK9TKvtCnYv8tSTzQh3azQ0/0Y+gcH4=" -> null
      - source_code_size               = 856 -> null
      - tags                           = {} -> null
      - tags_all                       = {
          - "DeployedBy" = "Terraform"
        } -> null
      - timeout                        = 10 -> null
      - version                        = "$LATEST" -> null
        # (6 unchanged attributes hidden)

      - environment {
          - variables = {
              - "BUCKET_NAME" = "prod-animeutopia-media-bucket"
            } -> null
        }

      - ephemeral_storage {
          - size = 512 -> null
        }

      - logging_config {
          - log_format            = "Text" -> null
          - log_group             = "/aws/lambda/store_data" -> null
            # (2 unchanged attributes hidden)
        }

      - tracing_config {
          - mode = "PassThrough" -> null
        }
    }

  # aws_lambda_permission.allow_sns_invoke will be created
+ resource "aws_lambda_permission" "allow_sns_invoke" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "sns_to_teams"
      + id                  = (known after apply)
      + principal           = "sns.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "AllowExecutionFromSNS"
      + statement_id_prefix = (known after apply)
    }

  # aws_nat_gateway.example_nat will be destroyed
  # (because aws_nat_gateway.example_nat is not in configuration)
- resource "aws_nat_gateway" "example_nat" {
      - allocation_id                      = "eipalloc-034b2d3256256046b" -> null
      - association_id                     = "eipassoc-0ffdee231620e52ee" -> null
      - connectivity_type                  = "public" -> null
      - id                                 = "nat-04c98412790a8b862" -> null
      - network_interface_id               = "eni-071e967423b242547" -> null
      - private_ip                         = "10.0.0.7" -> null
      - public_ip                          = "3.147.172.222" -> null
      - secondary_allocation_ids           = [] -> null
      - secondary_private_ip_address_count = 0 -> null
      - secondary_private_ip_addresses     = [] -> null
      - subnet_id                          = "subnet-0e19d48f4774333d2" -> null
      - tags                               = {} -> null
      - tags_all                           = {
          - "DeployedBy" = "Terraform"
        } -> null
    }

  # aws_route.private_route_to_nat will be destroyed
  # (because aws_route.private_route_to_nat is not in configuration)
- resource "aws_route" "private_route_to_nat" {
      - destination_cidr_block      = "0.0.0.0/0" -> null
      - id                          = "r-rtb-0fbf6843fff2761ef1080289494" -> null
      - nat_gateway_id              = "nat-04c98412790a8b862" -> null
      - origin                      = "CreateRoute" -> null
      - route_table_id              = "rtb-0fbf6843fff2761ef" -> null
      - state                       = "active" -> null
        # (13 unchanged attributes hidden)
    }

  # aws_route.public_route_to_igw will be destroyed
  # (because aws_route.public_route_to_igw is not in configuration)
- resource "aws_route" "public_route_to_igw" {
      - destination_cidr_block      = "0.0.0.0/0" -> null
      - gateway_id                  = "igw-0ed132994ed923492" -> null
      - id                          = "r-rtb-0c7672677319d83cf1080289494" -> null
      - origin                      = "CreateRoute" -> null
      - route_table_id              = "rtb-0c7672677319d83cf" -> null
      - state                       = "active" -> null
        # (13 unchanged attributes hidden)
    }

  # aws_route_table.private_rt will be destroyed
  # (because aws_route_table.private_rt is not in configuration)
- resource "aws_route_table" "private_rt" {
      - arn              = "arn:aws:ec2:us-east-2:481665084477:route-table/rtb-0fbf6843fff2761ef" -> null
      - id               = "rtb-0fbf6843fff2761ef" -> null
      - owner_id         = "481665084477" -> null
      - propagating_vgws = [] -> null
      - route            = [
          - {
              - cidr_block                 = "0.0.0.0/0"
              - nat_gateway_id             = "nat-04c98412790a8b862"
                # (11 unchanged attributes hidden)
            },
        ] -> null
      - tags             = {
          - "Name" = "private-rt"
        } -> null
      - tags_all         = {
          - "DeployedBy" = "Terraform"
          - "Name"       = "private-rt"
        } -> null
      - vpc_id           = "vpc-032fa89d4525841f0" -> null
    }

  # aws_route_table.public_rt will be destroyed
  # (because aws_route_table.public_rt is not in configuration)
- resource "aws_route_table" "public_rt" {
      - arn              = "arn:aws:ec2:us-east-2:481665084477:route-table/rtb-0c7672677319d83cf" -> null
      - id               = "rtb-0c7672677319d83cf" -> null
      - owner_id         = "481665084477" -> null
      - propagating_vgws = [] -> null
      - route            = [
          - {
              - cidr_block                 = "0.0.0.0/0"
              - gateway_id                 = "igw-0ed132994ed923492"
                # (11 unchanged attributes hidden)
            },
        ] -> null
      - tags             = {
          - "Name" = "public-rt"
        } -> null
      - tags_all         = {
          - "DeployedBy" = "Terraform"
          - "Name"       = "public-rt"
        } -> null
      - vpc_id           = "vpc-032fa89d4525841f0" -> null
    }

  # aws_route_table_association.private_rta will be destroyed
  # (because aws_route_table_association.private_rta is not in configuration)
- resource "aws_route_table_association" "private_rta" {
      - id             = "rtbassoc-04e21e65c73b5ba7c" -> null
      - route_table_id = "rtb-0fbf6843fff2761ef" -> null
      - subnet_id      = "subnet-04e8b4750edd74d6c" -> null
        # (1 unchanged attribute hidden)
    }

  # aws_route_table_association.public_rta will be destroyed
  # (because aws_route_table_association.public_rta is not in configuration)
- resource "aws_route_table_association" "public_rta" {
      - id             = "rtbassoc-0cf29ada83d6a6390" -> null
      - route_table_id = "rtb-0c7672677319d83cf" -> null
      - subnet_id      = "subnet-0e19d48f4774333d2" -> null
        # (1 unchanged attribute hidden)
    }

  # aws_s3_bucket.media_bucket will be updated in-place
~ resource "aws_s3_bucket" "media_bucket" {
        id                          = "prod-animeutopia-media-bucket"
        tags                        = {}
      ~ tags_all                    = {
          + "Environment" = "prod"
          + "Project"     = "project"
            # (1 unchanged element hidden)
        }
        # (12 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_s3_bucket_lifecycle_configuration.media_bucket_lifecycle will be created
+ resource "aws_s3_bucket_lifecycle_configuration" "media_bucket_lifecycle" {
      + bucket                                 = "prod-animeutopia-media-bucket"
      + expected_bucket_owner                  = (known after apply)
      + id                                     = (known after apply)
      + transition_default_minimum_object_size = "all_storage_classes_128K"

      + rule {
          + id     = "delete_posts_after_1_week"
          + prefix = (known after apply)
          + status = "Enabled"

          + expiration {
              + days                         = 7
              + expired_object_delete_marker = (known after apply)
            }

          + filter {
              + object_size_greater_than = (known after apply)
              + object_size_less_than    = (known after apply)
              + prefix                   = "posts/"
            }
        }
    }

  # aws_s3_bucket_server_side_encryption_configuration.media_bucket_encryption will be created
+ resource "aws_s3_bucket_server_side_encryption_configuration" "media_bucket_encryption" {
      + bucket = "prod-animeutopia-media-bucket"
      + id     = (known after apply)

      + rule {
          + bucket_key_enabled = true

          + apply_server_side_encryption_by_default {
              + kms_master_key_id = "alias/aws/s3"
              + sse_algorithm     = "aws:kms"
            }
        }
    }

  # aws_security_group.efs_sg will be destroyed
  # (because aws_security_group.efs_sg is not in configuration)
- resource "aws_security_group" "efs_sg" {
      - arn                    = "arn:aws:ec2:us-east-2:481665084477:security-group/sg-0352113cf7b778773" -> null
      - description            = "Security group for EFS mount for Lambda" -> null
      - egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
                # (1 unchanged attribute hidden)
            },
        ] -> null
      - id                     = "sg-0352113cf7b778773" -> null
      - ingress                = [
          - {
              - cidr_blocks      = [
                  - "10.0.0.0/16",
                ]
              - from_port        = 2049
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 2049
                # (1 unchanged attribute hidden)
            },
        ] -> null
      - name                   = "efs_lambda_sg" -> null
      - owner_id               = "481665084477" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {} -> null
      - tags_all               = {
          - "DeployedBy" = "Terraform"
        } -> null
      - vpc_id                 = "vpc-032fa89d4525841f0" -> null
        # (1 unchanged attribute hidden)
    }

  # aws_security_group.lambda_sg will be destroyed
  # (because aws_security_group.lambda_sg is not in configuration)
- resource "aws_security_group" "lambda_sg" {
      - arn                    = "arn:aws:ec2:us-east-2:481665084477:security-group/sg-003032d1214f56b1d" -> null
      - description            = "Allow Lambda to call out to the internet" -> null
      - egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
                # (1 unchanged attribute hidden)
            },
        ] -> null
      - id                     = "sg-003032d1214f56b1d" -> null
      - ingress                = [
          - {
              - cidr_blocks      = [
                  - "10.0.0.0/16",
                ]
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
                # (1 unchanged attribute hidden)
            },
        ] -> null
      - name                   = "lambda-sg" -> null
      - owner_id               = "481665084477" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {
          - "Name" = "lambda-sg"
        } -> null
      - tags_all               = {
          - "DeployedBy" = "Terraform"
          - "Name"       = "lambda-sg"
        } -> null
      - vpc_id                 = "vpc-032fa89d4525841f0" -> null
        # (1 unchanged attribute hidden)
    }

  # aws_sfn_state_machine.anime_workflow will be destroyed
  # (because aws_sfn_state_machine.anime_workflow is not in configuration)
- resource "aws_sfn_state_machine" "anime_workflow" {
      - arn                       = "arn:aws:states:us-east-2:481665084477:stateMachine:anime_workflow" -> null
      - creation_date             = "2025-03-11T18:53:20Z" -> null
      - definition                = jsonencode(
            {
              - Comment = "State machine for automating anime post workflow with MoviePy"
              - StartAt = "FetchRSS"
              - States  = {
                  - CheckPost      = {
                      - Choices = [
                          - {
                              - Next         = "ProcessContent"
                              - StringEquals = "anime_post_found"
                              - Variable     = "$.rssData.status"
                            },
                        ]
                      - Default = "EndWorkflow"
                      - Type    = "Choice"
                    }
                  - EndWorkflow    = {
                      - Type = "Succeed"
                    }
                  - FetchRSS       = {
                      - Next       = "CheckPost"
                      - Resource   = "arn:aws:lambda:us-east-2:481665084477:function:fetch_rss"
                      - ResultPath = "$.rssData"
                      - Type       = "Task"
                    }
                  - NotifyUser     = {
                      - End        = true
                      - InputPath  = "$.videoResult"
                      - Resource   = "arn:aws:lambda:us-east-2:481665084477:function:notify_post"
                      - ResultPath = "$.notificationResult"
                      - Type       = "Task"
                    }
                  - ProcessContent = {
                      - Next       = "StoreData"
                      - Resource   = "arn:aws:lambda:us-east-2:481665084477:function:process_content"
                      - ResultPath = "$.processedContent"
                      - Type       = "Task"
                    }
                  - RenderVideo    = {
                      - Next       = "NotifyUser"
                      - Resource   = "arn:aws:lambda:us-east-2:481665084477:function:render_video"
                      - ResultPath = "$.videoResult"
                      - Type       = "Task"
                    }
                  - StoreData      = {
                      - Next       = "RenderVideo"
                      - Resource   = "arn:aws:lambda:us-east-2:481665084477:function:store_data"
                      - ResultPath = "$.storeResult"
                      - Type       = "Task"
                    }
                }
            }
        ) -> null
      - id                        = "arn:aws:states:us-east-2:481665084477:stateMachine:anime_workflow" -> null
      - name                      = "anime_workflow" -> null
      - publish                   = false -> null
      - revision_id               = "26d1c07a-48f2-444c-868e-28b3fd6c6351" -> null
      - role_arn                  = "arn:aws:iam::481665084477:role/anime_step_functions_role" -> null
      - status                    = "ACTIVE" -> null
      - tags                      = {} -> null
      - tags_all                  = {
          - "DeployedBy" = "Terraform"
        } -> null
      - type                      = "STANDARD" -> null
        # (3 unchanged attributes hidden)

      - encryption_configuration {
          - kms_data_key_reuse_period_seconds = 0 -> null
          - type                              = "AWS_OWNED_KEY" -> null
            # (1 unchanged attribute hidden)
        }

      - logging_configuration {
          - include_execution_data = false -> null
          - level                  = "OFF" -> null
            # (1 unchanged attribute hidden)
        }

      - tracing_configuration {
          - enabled = false -> null
        }
    }

  # aws_sfn_state_machine.automated_workflow will be created
+ resource "aws_sfn_state_machine" "automated_workflow" {
      + arn                       = (known after apply)
      + creation_date             = (known after apply)
      + definition                = (known after apply)
      + description               = (known after apply)
      + id                        = (known after apply)
      + name                      = "automated_animeutopia_workflow"
      + name_prefix               = (known after apply)
      + publish                   = false
      + revision_id               = (known after apply)
      + role_arn                  = (known after apply)
      + state_machine_version_arn = (known after apply)
      + status                    = (known after apply)
      + tags_all                  = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "project"
        }
      + type                      = "EXPRESS"
      + version_description       = (known after apply)

      + encryption_configuration (known after apply)

      + logging_configuration {
          + include_execution_data = true
          + level                  = "ALL"
          + log_destination        = (known after apply)
        }

      + tracing_configuration {
          + enabled = true
        }
    }

  # aws_sns_topic.monitoring_topic will be created
+ resource "aws_sns_topic" "monitoring_topic" {
      + arn                         = (known after apply)
      + beginning_archive_time      = (known after apply)
      + content_based_deduplication = false
      + fifo_topic                  = false
      + id                          = (known after apply)
      + name                        = "animeutopia-monitoring-topic"
      + name_prefix                 = (known after apply)
      + owner                       = (known after apply)
      + policy                      = (known after apply)
      + signature_version           = (known after apply)
      + tags_all                    = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "project"
        }
      + tracing_config              = (known after apply)
    }

  # aws_sns_topic_subscription.sns_lambda_subscription will be created
+ resource "aws_sns_topic_subscription" "sns_lambda_subscription" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = (known after apply)
      + endpoint_auto_confirms          = false
      + filter_policy_scope             = (known after apply)
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "lambda"
      + raw_message_delivery            = false
      + topic_arn                       = (known after apply)
    }

  # aws_sqs_queue.lambda_dlq will be created
+ resource "aws_sqs_queue" "lambda_dlq" {
      + arn                               = (known after apply)
      + content_based_deduplication       = false
      + deduplication_scope               = (known after apply)
      + delay_seconds                     = 0
      + fifo_queue                        = false
      + fifo_throughput_limit             = (known after apply)
      + id                                = (known after apply)
      + kms_data_key_reuse_period_seconds = (known after apply)
      + max_message_size                  = 262144
      + message_retention_seconds         = 345600
      + name                              = "animeutopia-lambda-dlq"
      + name_prefix                       = (known after apply)
      + policy                            = (known after apply)
      + receive_wait_time_seconds         = 0
      + redrive_allow_policy              = (known after apply)
      + redrive_policy                    = (known after apply)
      + sqs_managed_sse_enabled           = (known after apply)
      + tags_all                          = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "project"
        }
      + url                               = (known after apply)
      + visibility_timeout_seconds        = 30
    }

  # aws_sqs_queue_policy.lambda_dlq_policy will be created
+ resource "aws_sqs_queue_policy" "lambda_dlq_policy" {
      + id        = (known after apply)
      + policy    = (known after apply)
      + queue_url = (known after apply)
    }

  # aws_subnet.private_subnet will be destroyed
  # (because aws_subnet.private_subnet is not in configuration)
- resource "aws_subnet" "private_subnet" {
      - arn                                            = "arn:aws:ec2:us-east-2:481665084477:subnet/subnet-04e8b4750edd74d6c" -> null
      - assign_ipv6_address_on_creation                = false -> null
      - availability_zone                              = "us-east-2b" -> null
      - availability_zone_id                           = "use2-az2" -> null
      - cidr_block                                     = "10.0.1.0/24" -> null
      - enable_dns64                                   = false -> null
      - enable_lni_at_device_index                     = 0 -> null
      - enable_resource_name_dns_a_record_on_launch    = false -> null
      - enable_resource_name_dns_aaaa_record_on_launch = false -> null
      - id                                             = "subnet-04e8b4750edd74d6c" -> null
      - ipv6_native                                    = false -> null
      - map_customer_owned_ip_on_launch                = false -> null
      - map_public_ip_on_launch                        = false -> null
      - owner_id                                       = "481665084477" -> null
      - private_dns_hostname_type_on_launch            = "ip-name" -> null
      - tags                                           = {
          - "Name" = "private-subnet"
        } -> null
      - tags_all                                       = {
          - "DeployedBy" = "Terraform"
          - "Name"       = "private-subnet"
        } -> null
      - vpc_id                                         = "vpc-032fa89d4525841f0" -> null
        # (4 unchanged attributes hidden)
    }

  # aws_subnet.public_subnet will be destroyed
  # (because aws_subnet.public_subnet is not in configuration)
- resource "aws_subnet" "public_subnet" {
      - arn                                            = "arn:aws:ec2:us-east-2:481665084477:subnet/subnet-0e19d48f4774333d2" -> null
      - assign_ipv6_address_on_creation                = false -> null
      - availability_zone                              = "us-east-2b" -> null
      - availability_zone_id                           = "use2-az2" -> null
      - cidr_block                                     = "10.0.0.0/24" -> null
      - enable_dns64                                   = false -> null
      - enable_lni_at_device_index                     = 0 -> null
      - enable_resource_name_dns_a_record_on_launch    = false -> null
      - enable_resource_name_dns_aaaa_record_on_launch = false -> null
      - id                                             = "subnet-0e19d48f4774333d2" -> null
      - ipv6_native                                    = false -> null
      - map_customer_owned_ip_on_launch                = false -> null
      - map_public_ip_on_launch                        = true -> null
      - owner_id                                       = "481665084477" -> null
      - private_dns_hostname_type_on_launch            = "ip-name" -> null
      - tags                                           = {
          - "Name" = "public-subnet"
        } -> null
      - tags_all                                       = {
          - "DeployedBy" = "Terraform"
          - "Name"       = "public-subnet"
        } -> null
      - vpc_id                                         = "vpc-032fa89d4525841f0" -> null
        # (4 unchanged attributes hidden)
    }

  # aws_vpc.example_vpc will be destroyed
  # (because aws_vpc.example_vpc is not in configuration)
- resource "aws_vpc" "example_vpc" {
      - arn                                  = "arn:aws:ec2:us-east-2:481665084477:vpc/vpc-032fa89d4525841f0" -> null
      - assign_generated_ipv6_cidr_block     = false -> null
      - cidr_block                           = "10.0.0.0/16" -> null
      - default_network_acl_id               = "acl-0c55f205548edc0a3" -> null
      - default_route_table_id               = "rtb-0904af69ed48d74bb" -> null
      - default_security_group_id            = "sg-0102316159c77170f" -> null
      - dhcp_options_id                      = "dopt-0fca1f7eb86193d37" -> null
      - enable_dns_hostnames                 = false -> null
      - enable_dns_support                   = true -> null
      - enable_network_address_usage_metrics = false -> null
      - id                                   = "vpc-032fa89d4525841f0" -> null
      - instance_tenancy                     = "default" -> null
      - ipv6_netmask_length                  = 0 -> null
      - main_route_table_id                  = "rtb-0904af69ed48d74bb" -> null
      - owner_id                             = "481665084477" -> null
      - tags                                 = {
          - "Name" = "example-vpc"
        } -> null
      - tags_all                             = {
          - "DeployedBy" = "Terraform"
          - "Name"       = "example-vpc"
        } -> null
        # (4 unchanged attributes hidden)
    }

  # aws_xray_group.production_group will be created
+ resource "aws_xray_group" "production_group" {
      + arn               = (known after apply)
      + filter_expression = "annotation.stage = \"prod\""
      + group_name        = "ProductionTraces"
      + id                = (known after apply)
      + tags_all          = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "project"
        }

      + insights_configuration (known after apply)
    }

  # aws_xray_sampling_rule.critical_service_rule will be created
+ resource "aws_xray_sampling_rule" "critical_service_rule" {
      + arn            = (known after apply)
      + fixed_rate     = 1
      + host           = "*"
      + http_method    = "*"
      + id             = (known after apply)
      + priority       = 10
      + reservoir_size = 2
      + resource_arn   = "*"
      + rule_name      = "CriticalService"
      + service_name   = "critical"
      + service_type   = "*"
      + tags_all       = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "project"
        }
      + url_path       = "*"
      + version        = 1
    }

  # aws_xray_sampling_rule.fallback_rule will be created
+ resource "aws_xray_sampling_rule" "fallback_rule" {
      + arn            = (known after apply)
      + fixed_rate     = 0.05
      + host           = "*"
      + http_method    = "*"
      + id             = (known after apply)
      + priority       = 9999
      + reservoir_size = 1
      + resource_arn   = "*"
      + rule_name      = "Fallback"
      + service_name   = "*"
      + service_type   = "*"
      + tags_all       = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "project"
        }
      + url_path       = "*"
      + version        = 1
    }

Plan: 55 to add, 2 to change, 34 to destroy.

Changes to Outputs:
- s3_bucket_name    = "prod-animeutopia-media-bucket" -> null
- state_machine_arn = "arn:aws:states:us-east-2:481665084477:stateMachine:anime_workflow" -> null
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p animeutopia-prod
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://atlantis.feedutopia.com:4141/lock?id=ryan-longoria%252FFeedUtopia%252Faccounts%252Fanimeutopia-prod%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p animeutopia-prod
  ```
Plan: 55 to add, 2 to change, 34 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```